In [1]:
import pymongo
import pandas as pd
from pyhive import hive
from urllib.parse import quote
import urllib.parse

In [2]:
client = pymongo.MongoClient("mongodb://localhost:27017/")
db = client["concessionaire_voiture"] 
collection = db["clients"]  

cursor = collection.find({})

In [3]:
df = pd.DataFrame(list(cursor))

In [4]:
client.close()

In [5]:
# remove all lines with missing values 
print(df.shape[0])
df.replace('', pd.NA, inplace=True) 
df.dropna(inplace=True)
print(df.shape[0])

200000
198793

In [6]:
df['age'] = pd.to_numeric(df['age'], errors='coerce')
df['taux'] = pd.to_numeric(df['taux'], errors='coerce')
df['nbEnfantsAcharge'] = pd.to_numeric(df['nbEnfantsAcharge'], errors='coerce')
df = df[(df['age'] >= 0) & (df['taux'] >= 0)]
print(df.shape[0])

198000

In [7]:
print(df['nbEnfantsAcharge'].unique())

[ 4.  0.  3.  1.  2. -1. nan]

In [8]:
df['nbEnfantsAcharge'] = df['nbEnfantsAcharge'].fillna(0).astype(int)
print(df.dtypes)

_id                    object
age                   float64
sexe                   object
taux                  float64
situationFamiliale     object
nbEnfantsAcharge        int64
2eme voiture           object
immatriculation        object
dtype: object

In [9]:
print(df['sexe'].unique())

['M' 'F' 'Masculin' 'Féminin' 'Femme' 'Homme' 'N/D' '?']

In [10]:
print(df['sexe'].value_counts())

sexe
M           135315
F            58280
Masculin      1400
Homme         1337
Femme          642
Féminin        627
N/D            200
?              199
Name: count, dtype: int64

In [11]:
filtered_df = df[~df['sexe'].isin(['N/D', '?']) & (df['sexe']!= '')]

In [12]:
print(filtered_df['sexe'].unique())

['M' 'F' 'Masculin' 'Féminin' 'Femme' 'Homme']

In [13]:
mapping_gender = {
    'F': 'F',
    'M': 'H',
    'Homme': 'H',
    'Femme': 'F',
    'Masculin': 'H',
    'Féminin': 'F'
}

In [14]:
filtered_df.loc[:, 'sexe'] = filtered_df['sexe'].map(mapping_gender)

In [15]:
print(filtered_df['sexe'].unique())

['H' 'F']

In [16]:
print(filtered_df['situationFamiliale'].value_counts())

situationFamiliale
En Couple      126760
Célibataire     58753
Seule            9682
Marié(e)         1308
Seul              599
?                 203
N/D               186
Divorcée          110
Name: count, dtype: int64

In [17]:
print(filtered_df['situationFamiliale'].unique())

['En Couple' 'Célibataire' 'Seule' 'Marié(e)' 'Seul' '?' 'N/D' 'Divorcée']

In [18]:
filtered_df_ = filtered_df[~filtered_df['situationFamiliale'].isin(['N/D', '?']) & (filtered_df['situationFamiliale']!= '')]

In [19]:
print(filtered_df_['situationFamiliale'].value_counts())

situationFamiliale
En Couple      126760
Célibataire     58753
Seule            9682
Marié(e)         1308
Seul              599
Divorcée          110
Name: count, dtype: int64

In [20]:
filtered_df_copy = filtered_df_.copy()
r_nb_enfants = filtered_df_copy.groupby('situationFamiliale').agg({'nbEnfantsAcharge': 'sum', 'situationFamiliale': 'count'})
r_nb_enfants.rename(columns={'nbEnfantsAcharge': 'sum_nbEnfantsAcharge', 'situationFamiliale': 'count_situationFamiliale'}, inplace=True)
print(r_nb_enfants)

                    sum_nbEnfantsAcharge  count_situationFamiliale
situationFamiliale
Célibataire                          -59                     58753
Divorcée                             209                       110
En Couple                         223726                    126760
Marié(e)                            2332                      1308
Seul                                   0                       599
Seule                              19400                      9682

In [21]:
seul_df = filtered_df_copy[filtered_df_copy['situationFamiliale'] == 'Seule']
sum_distinct_nb_enfants_seul = seul_df['nbEnfantsAcharge'].value_counts()
print(sum_distinct_nb_enfants_seul)

nbEnfantsAcharge
 3    3251
 2    3244
 1    3167
 0      12
-1       8
Name: count, dtype: int64

In [22]:
mapping_marital_status = {
    'En Couple': 'En Couple',
    'Célibataire': 'Célibataire',
    'Seule': 'Seul(e)',
    'Marié(e)': 'En Couple',
    'Seul': 'Seul(e)',
    'Divorcée': 'Divorcée'
}

In [23]:
filtered_df__ = filtered_df_
filtered_df__.loc[:, 'situationFamiliale'] = filtered_df__['situationFamiliale'].map(mapping_marital_status)

In [24]:
print(filtered_df__["situationFamiliale"].unique())

['En Couple' 'Célibataire' 'Seul(e)' 'Divorcée']

In [25]:
print(filtered_df__['2eme voiture'].value_counts())

2eme voiture
false    171401
true      25608
?           203
Name: count, dtype: int64

In [26]:
filtered_df___ = filtered_df__[~filtered_df__['2eme voiture'].isin(['?']) & (filtered_df__['2eme voiture']!= '')]

In [27]:
print(filtered_df___['2eme voiture'].value_counts())

2eme voiture
false    171401
true      25608
Name: count, dtype: int64

In [28]:
!pip install thrift_sasl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: thrift_sasl in /home/vagrant/.local/lib/python3.9/site-packages (0.4.3)
Requirement already satisfied: pure-sasl>=0.6.2 in /home/vagrant/.local/lib/python3.9/site-packages (from thrift_sasl) (0.6.2)
Requirement already satisfied: six>=1.13.0 in /home/vagrant/.local/lib/python3.9/site-packages (from thrift_sasl) (1.16.0)
Requirement already satisfied: thrift>=0.10.0 in /home/vagrant/.local/lib/python3.9/site-packages (from thrift_sasl) (0.20.0)

In [29]:
conn = hive.Connection(host="localhost", port=10000, username='vagrant', database = "concessionaire")

cursor = conn.cursor()

In [32]:
create_table_sql = """
CREATE TABLE IF NOT EXISTS clients (
    age INT,
    sexe STRING,
    taux DOUBLE,
    situationFamiliale STRING,
    nbEnfantsAcharge INT,
    deuxiemeVoiture STRING,
    immatriculation STRING
)
"""
insert_query = f"INSERT INTO clients (age, sexe, taux, situationFamiliale, nbEnfantsAcharge, deuxiemeVoiture, immatriculation) VALUES (?, ?, ?, ?, ?, ?, ?)"

In [33]:
cursor.execute(create_table_sql)

In [37]:
if '_id' in filtered_df___.columns:
    filtered_df___ = filtered_df___.drop('_id', axis=1)
if "2eme voiture" in filtered_df___.columns:
    filtered_df___.rename(columns={'2eme voiture': 'deuxiemeVoiture'}, inplace=True)
print(filtered_df___.dtypes)

age                   float64
sexe                   object
taux                  float64
situationFamiliale     object
nbEnfantsAcharge        int64
deuxiemeVoiture        object
immatriculation        object
dtype: object

In [38]:
filtered_df___

,age,sexe,taux,situationFamiliale,nbEnfantsAcharge,deuxiemeVoiture,immatriculation
0,58.0,H,921.0,En Couple,4,false,3684 VW 75
1,57.0,H,462.0,Célibataire,0,false,4650 WY 57
2,58.0,F,525.0,En Couple,3,true,8157 VN 51
3,18.0,H,728.0,Célibataire,0,false,9715 CH 60
4,33.0,H,1113.0,Célibataire,0,false,7679 ZL 41
...,...,...,...,...,...,...,...
199995,32.0,H,951.0,En Couple,4,false,9637 QW 55
199996,28.0,H,201.0,En Couple,3,false,8011 XH 80
199997,43.0,F,456.0,En Couple,3,false,845 FF 12
199998,76.0,H,825.0,Célibataire,0,false,8251 NJ 75
199999,26.0,H,830.0,Célibataire,0,false,6253 NE 73

In [ ]:
# csv_path = '/tmp/clients.csv'
# filtered_df___.to_csv(csv_path, index=False, header=False)

In [ ]:
# cursor.execute(f"LOAD DATA LOCAL INPATH '{csv_path}' INTO TABLE clients")

In [39]:
batch_size = 10000

for i in range(0, len(filtered_df___), batch_size):
    batch_df = filtered_df___.iloc[i:i+batch_size]
    values = ','.join(['({})'.format(','.join(["'{}'".format(str(val)) for val in row])) for row in batch_df.values])
    cursor.execute("""
        INSERT INTO clients (age, sexe, taux, situationFamiliale, nbEnfantsAcharge, deuxiemeVoiture, immatriculation)
        VALUES {}
    """.format(values))
    
    print(i)

0
10000
20000
30000
40000
50000
60000
70000
80000
90000
100000
110000
120000
130000
140000
150000
160000
170000
180000
190000

In [ ]:
# Commit the transaction
conn.commit()

# Close cursor and connection
cursor.close()
conn.close()